/*!
 * \file
 * \brief Задача 2
 *
 * 2. Принять с клавиатуры координаты 𝑥𝑎, 𝑦𝑎, 𝑥𝑏, 𝑦𝑏, 𝑥𝑐, 𝑦𝑐 треугольника 𝑎𝑏𝑐 на плоскости. 
 * Найти и вывести на экран периметр 𝑃 треугольника.
 */

#include <stdio.h>
#include <math.h>

/*!
 * \brief Считает периметр
 *
 * Данная функция запрашивает координаты трех точек треугольника,
 * которые являются дробными числами xa, ya, xb, yb, xc, yc,
 * и выводит на экран его периметр,
 * который является дробным числом perimeter.
 */
int main(void)
{
    double xa, ya, xb, yb, xc, yc;
    double perimeter;

    printf("Введите координаты xa, ya, xb, yb, xc, yc треугольника abc: ");
    scanf("%lf%lf%lf%lf%lf%lf", &xa, &ya, &xb, &yb, &xc, &yc);

    perimeter = sqrt(pow(xa - xb, 2) + pow(ya - yb, 2)) + 
        sqrt(pow(xb - xc, 2) + pow(yb - yc, 2)) + 
        sqrt(pow(xc - xa, 2) + pow(yc - ya, 2));
    printf("Периметр треугольника: %lf\n", perimeter);

    return 0;
}