/*!
 * \file
 * \brief Задача 1
 *
 * По матрице получить и вывести на экран одномерный массив, 
 * присвоив его 𝑘-тому элементу значение 1, 
 * если выполняется указанное условие, и значение 0 в иных случаях: 
 * 1. 𝑘-ая строка матрицы симметрична;
 */

#include "f.h"
#include "io.h"
#include "consts.h"

/*!
 * \brief Симметричность строк матрицы
 *
 * Данная функция использует функцию matrix_input из модуля io.h, 
 * чтобы принять целочисленную матрицу matrix.
 * Затем, с помощью функции array_fill из модуля f.h 
 * заполняет массив arr результатами симметричности строк
 * В конце выводит массив arr с помощью функции array_print из модуля io.h
 */
int main(void)
{
    long int matrix[M_MAX][N_MAX] = { 0 };
    size_t m, n;
    long int arr[M_MAX] = { 0 };
    int r;

    if (r = matrix_input(matrix, &m, &n), r != 0)
        return r;

    array_fill(matrix, m, n, arr);
    array_print(arr, m);
    return 0;
}