# Князь света (Lord of Light) [пер. В.Лапицкого]
# Роджер Джозеф Желязны
fragment1 = ['Поблизости от города Алуинда раскинулась роскошная роща, ',
             'деревья с голубой корой венчала там пурпурная листва, ',
             'легкостью подобная перу. Прославлена была эта роща своей ',
             'красотой, а также и священным покоем, что царил под ее ',
             'сенью. До его обращения принадлежала купцу Васу, который',
             'потом предоставил ее Учителю, известному и под именем ',
             'Махасаматман, и под прозвищем Татхагата, и как ',
             'Просветленный. В этой роще и обосновался Учитель со ',
             'своими последователями, и когда проходили они среди дня ',
             'по городу, никогда не оставались пустыми их чаши для',
             'подаяний. ']

# Сомнамбулический поиск неведомого Кадата
# Говард Филлипс Лавкрафт
fragment2 = ['Трижды Рэндольфу Картеру снился этот чудесный город и трижды его вырывали из ',
             'сна, когда он стоял неподвижно на высокой базальтовой террасе. Весь в золоте, ',
             'дивный город сиял в лучах закатного солнца, освещавшего стены, храмы, ',
             'колоннады и арочные мосты, ',
             'сложенные из мрамора',
             'с прожилками, фонтаны с ',
             'радужными струями посреди серебряных бассейнов на просторных площадях и в ',
             'благоуханных садах; широкие улицы, тянущиеся между хрупкими деревьями, ',
             'мраморными вазами с цветами и статуями из слоновой кости, что выстроились ',
             'сверкающими рядами; а вверх по крутым северным склонам карабкались уступами ',
             'вереницы черепичных крыш и старинные остроконечные фронтоны — вдоль узких, ',
             'мощенных мшистой брусчаткой переулков. То был восторг богов, глас божественных ',
             'труб и бряцанье бессмертных кимвалов. Тайна объяла его, точно тучи легендарную ',
             'безлюдную гору, и, покуда ошеломленный и мучимый неясным предчувствием Картер ',
             'стоял на кромке горной балюстрады, его мучили острая тревога почти что угасших ',
             'воспоминаний, боль об утраченном и безумное желание вновь посетить некогда ',
             'чарующие и покинутые им места. ']

# Немеркнущий зной Ифрезима
fragment3 = ['Зной над Ифрезимом рассеялся, будто бы его и не было вовсе. Однако, никто уже не ',
             'знал существовал ли этот город на самом деле. Теперь, пробираясь по перешейку ',
             'между горами Бар-Корама и союзными владениями сардара Схир-База купцы и ',
             'путешественники не видели ни колонн, ни стеклянных джиннов, а только огромное ',
             'стеклянное озеро, которое остается раскалённым, несмотря на обычную температуру ',
             'вокруг. Мудрецы говорят, что никакого Ифрезима и не было, а виной этой легенде ',
             'подземные вулканы, которые выжигают землю и плавят песок. Местные умельцы делают ',
             'из него стеклянные счёты, курительные трубки и кальянные колбы и продают по ',
             'тройной цене, потому что иногда в стекле попадаются красивые золотистые прожилки ',
             'и вкрапления азуритовых кристаллов. ']

# Занимательная энциклопедия эрудита
# Яков Исидорович Перельман
fragment4 = ['Если теперь нас спросят, какова высота Эйфелевой башни, то прежде чем ',
             'ответить: “300 метров”, вы, вероятно, осведомитесь: — В какую погоду ',
             '— холодную или теплую? Ведь высота столь огромного железного ',
             'сооружения не может быть одинакова при всякой температуре. Мы знаем, ',
             'что железный стержень длиной 300 м удлиняется на 3 мм при нагревании ',
             'его на один градус. Приблизительно на столько же должна возрастать и ',
             'высота Эйфелевой башни при повышении температуры на 1°. В теплую ',
             'солнечную погоду железный материал башни может нагреться в Париже ',
             'градусов до +40, между тем как в холодный, дождливый день температура ',
             'его падает до +10°. а зимою до 0°, даже до — 10° (большие морозы в ',
             'Париже редки). Как видим, колебания температуры доходят до 40 и более ',
             'градусов. Значит, высота Эйфелевой башни может колебаться на 3 * 40 = ',
             '120 мм, или на 12 см (больше длины этой строки). 2 + 2 - ']

fragment5 = ['a a3+ + 4',
             'b 4 + 3',
             'c 1+2 + 3',
             'd 3+4',
             'ef88+f8 + 4f 44++4',
             '++ f +++ g + + g',
             'f 44 45 g 34 + 434 45+ 4 af 0',
             '4f 89   +        2 аа +1+1',
             ' +    3- 4',
             '9--3 9 --3 9-- 3 9- -3 9- - 3']
