# Равашдех Фадей ИУ7-15Б
# 92

x = float(input('Введите Х: '))
acc = float(input('Введите точность: '))

s = 0       # Сумма ряда
n = 0       # n
df = 1      # (2*n)!
prev_t = 0  # n член ряда
t = 0.1     # n+1 член ряда

while True:
    t = (-1)**(n - 1 % 2) * (2*n - 1) / df
    # t *= x**(2*n)
    s += t*x**(2*n)
    print(f'{n:3g} {df:15g} {s:20.15g} {t*x**(2*n): }')
    if abs(x**(2*(n-1))*(prev_t - t*x**2)) < acc:
        break
    prev_t = t
    df *= (2*n + 2)*(2*n + 1)
    n += 1

print(f'Сумма бесконечного ряда с указанной точностью равна: {s:10g}')
