/*!
 * \file
 * \brief Задача 1
 *
 * Найдите и исправьте ошибки в программе.
 */

#include <stdio.h>

/*!
 * \brief Основная функция
 *
 * Функция выводит текст "Year has 52 weeks"
 */
int main(void)
{
    int s;
    
    s = 52;
    printf("Year has %d weeks\n", s);
    return 0;
}