/*!
 * \file
 * \brief Задача 5
 *
 * 2. Вычислить и вывести на экран число Фибоначчи Fib𝑛, приняв с клавиатуры целое неотрицательное 𝑛. 
 * Рекурсивных функций не использовать, положить Fib0 = 0, Fib1 = 1. 
 * Предусмотреть возможное переполнение целого числа при решении.
 */

#include <stdio.h>

#define LL_OVERFLOW 92                  // переполнение long long после 92

#define EXIT_CODE_INCORRECT_INPUT 1     // ошибка ввода
#define EXIT_CODE_NEGATIVE_N 2          // n < 0 
#define EXIT_CODE_OVERFLOW 3            // переполнение переменной fib

/*!
 * \brief Вычисляет n-ное число Фибоначчи
 *
 * \param n Номер числа
 * \return n-ное число Фибоначчи
 *
 * Данная функция принимает номер члена последовательности Фибоначчи,
 * которое является целым числом n,
 * и возвращает значение n-ного члена последовательности,
 * которое является целым числом fib.
 */
long long fibn(int n)
{
    long long fib0 = 0, fib1 = 1, fib;
    int i = 1;

    if (n == 0)
        return fib0;

    if (n == 1)
        return fib1;

    while (i < n)
    {
        fib = fib0 + fib1;
        fib0 = fib1;
        fib1 = fib;
        i++;
    }

    return fib;
}

/*!
 * \brief Основная функция
 *
 * Данная функция запрашивает номер члена последовательности Фибоначчи,
 * которое является целым числом n,
 * и выводит на экран значение n-ного члена последовательности,
 * которое является целым числом fib.
 */
int main(void)
{
    int n;
    long long fib;
    int r;

    printf("Введите n: ");
    r = scanf("%d", &n);

    if (r != 1)
        return EXIT_CODE_INCORRECT_INPUT;   // incorrect input

    if (n < 0)   
        return EXIT_CODE_NEGATIVE_N;        // negative

    if (n >= LL_OVERFLOW) 
        return EXIT_CODE_OVERFLOW;          // long long overflow

    fib = fibn(n);
    printf("%lld\n", fib);

    return 0;
}
