/*!
 * \file
 * \brief Задача 6
 *
 * 2. С клавиатуры задаются координаты 𝑥𝑎, 𝑦𝑎, 𝑥𝑏, 𝑦𝑏, 𝑥𝑐, 𝑦𝑐 вершин треугольника 𝑎𝑏𝑐 на плоскости 
 * и координаты точки 𝑥𝑝, 𝑦𝑝. Определить, лежит ли точка внутри, на границе или вне треугольника, 
 * и вывести на экран 0, 1 или 2 соответственно.
 */

#include <stdio.h>

#define MACHINE_EPS 0.00000001      // константа погрешности при сравнении дробного числа с нулем

#define EXIT_CODE_INCORRECT_INPUT 1 // ошибка ввода
#define EXIT_CODE_NO_TRIANGLE 2     // треугольника не существует
/*!
 * \brief Векторное произведение
 *
 * \param vector_a_x координта x вектора a
 * \param vector_a_y координта y вектора a
 * \param vector_b_x координта x вектора b
 * \param vector_b_y координта y вектора b
 * \return векторное произведение векторов a и b
 *
 * Данная функция принимает координаты x, y векторов a и b,
 * которые являются дробными числами vector_a_x, vector_a_y, vector_b_x, vector_b_y,
 * и возвращает их векторное произведение, которое является дробным числом.
 */
double vector_product(double vector_a_x, double vector_a_y, double vector_b_x, double vector_b_y)
{
    return vector_a_x * vector_b_y - vector_a_y * vector_b_x;
}

/*!
 * \brief Определяет местоположение точки относительно треугольника на плоскости
 *
 * Данная функция запрашивает координаты вершин треугольника на плоскости,
 * которые являются дробными числами xa, ya, xb, yb, xc, yc,
 * и координаты точки P, которые являются дробными числами xp, yp,
 * и выводит на экран:
 * 0, если точка Р лежит внутри теругольника,
 * 1, если точка Р лежит на стороне треугольника,
 * 2, если точка Р лежит вне треугольниука.
 */
int main(void)
{
    double xa, ya, xb, yb, xc, yc, xp, yp;  // координаты точек
    double vp, vp1, vp2, vp3;               // векторные произведения
    int r1, r2;

    printf("Введите координаты xa, ya, xb, yb, xc, yc треугольника abc: ");
    r1 = scanf("%lf%lf%lf%lf%lf%lf", &xa, &ya, &xb, &yb, &xc, &yc);

    printf("Введите координаты xp, yp точки: ");
    r2 = scanf("%lf%lf", &xp, &yp);

    if (r1 + r2 != 8)
        return EXIT_CODE_INCORRECT_INPUT;

    vp = vector_product(xb - xa, yb - ya, xc - xa, yc - ya);
    if ((vp > -MACHINE_EPS) & (vp < MACHINE_EPS))
        return EXIT_CODE_NO_TRIANGLE;   // если векторное произведение смежных сторон равно нулю, то треугольника не существует

    vp1 = vector_product(xb - xa, yb - ya, xp - xa, yp - ya);
    vp2 = vector_product(xc - xb, yc - yb, xp - xb, yp - yb);
    vp3 = vector_product(xa - xc, ya - yc, xp - xc, yp - yc);

    if ((vp1 * vp2 >= 0) & (vp2 * vp3 >= 0))
    {   
        if ((vp1 * vp2 * vp3 > -MACHINE_EPS) & (vp1 * vp2 * vp3 < MACHINE_EPS))
        {
            printf("1\n");  // хотя бы одно из векторных произведений равно нулю => точка лежит на стороне
        }
        else
        {
            printf("0\n");  // лежит в треугольнике, но не на стороне
        }
    }
    else
    {
        printf("2\n");
    }

    return 0;
}